// 8 KYU -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// Task 1
// Write a function that checks if a given string (case insensitive) is a palindrome.
// Напишите функцию, которая проверяет, является ли заданная строка (без учета регистра) палиндромом .

// function isPalindrome(x) {
//     const arrStr = x.split('').reverse().join('').toLowerCase();
//     let flag = false;

//     if (x.toLowerCase() == arrStr) {
//         flag = true;
//     } else {
//         flag = false;
//     }
//     return flag;
// }

// console.log(isPalindrome('Aba'));

// Task 2


// 7 KYU -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
